In [55]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

## Creating Dataframe

In [56]:
df = pd.DataFrame({
    'Name': ['Arun', 'Vijay', 'Priya', 'Kumar', 'Selvi', 'Kalaiyarasan', 'Sukumar', 'Vignesh', 'Ramya', 'Muthu'],
    'Age':[25, 20, 18, 19, 35, 23, 45, None, 16, 40],
    'Gender': ['Male', 'Male', 'Female', 'Male ee', 'Female', 'Male ee', 'Male', 'Male', 'Female', 'Male ee'],
    'Profession': ['Engineer', 'Doctor', 'Teacher', 'Scientist', 'Business', 'Engineer', 'Engineer', 'Lawyer', 'Auditor', 'Engineer'],
    'Location': ['Chennai', 'Bangalore', 'Mumabai', 'Delhi', 'Madurai', 'Chennai', 'Bangalore' , 'Pune', 'Chennai', 'Trichy']
})
df

           Name   Age   Gender Profession   Location
0          Arun  25.0     Male   Engineer    Chennai
1         Vijay  20.0     Male     Doctor  Bangalore
2         Priya  18.0   Female    Teacher    Mumabai
3         Kumar  19.0  Male ee  Scientist      Delhi
4         Selvi  35.0   Female   Business    Madurai
5  Kalaiyarasan  23.0  Male ee   Engineer    Chennai
6       Sukumar  45.0     Male   Engineer  Bangalore
7       Vignesh   NaN     Male     Lawyer       Pune
8         Ramya  16.0   Female    Auditor    Chennai
9         Muthu  40.0  Male ee   Engineer     Trichy

## Summary of a DataFrame

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        10 non-null     object
 1   Age         9 non-null      float64
 2   Gender      10 non-null     object
 3   Profession  10 non-null     object
 4   Location    10 non-null     object
dtypes: float64(1), object(4)
memory usage: 532.0+ bytes

## Dimentions of a DataFrame

In [58]:
df.shape

(10, 5)

## Display first 5 rows of a DataFrame

In [59]:
df.head()   #df.head(7)

    Name   Age   Gender Profession   Location
0   Arun  25.0     Male   Engineer    Chennai
1  Vijay  20.0     Male     Doctor  Bangalore
2  Priya  18.0   Female    Teacher    Mumabai
3  Kumar  19.0  Male ee  Scientist      Delhi
4  Selvi  35.0   Female   Business    Madurai

## Display last 5 rows of a DataFrame

In [60]:
df.tail() #df.tail(7)

           Name   Age   Gender Profession   Location
5  Kalaiyarasan  23.0  Male ee   Engineer    Chennai
6       Sukumar  45.0     Male   Engineer  Bangalore
7       Vignesh   NaN     Male     Lawyer       Pune
8         Ramya  16.0   Female    Auditor    Chennai
9         Muthu  40.0  Male ee   Engineer     Trichy

## Get all the column names of a DataFrame

In [79]:
df.columns.to_list()

['Name', 'Age', 'Gender', 'Profession', 'Location']

## Get all the row indexes of a DataFrame

In [62]:
df.index.to_list()

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

## Get specific column as a Series

In [63]:
df['Name']   #df.Name

0            Arun
1           Vijay
2           Priya
3           Kumar
4           Selvi
5    Kalaiyarasan
6         Sukumar
7         Vignesh
8           Ramya
9           Muthu
Name: Name, dtype: object

In [64]:
type(df['Name'])

pandas.core.series.Series

## Filter DataFrame with specific set of columns - Example #1

In [67]:
df[['Name','Age']]

           Name   Age
0          Arun  25.0
1         Vijay  20.0
2         Priya  18.0
3         Kumar  19.0
4         Selvi  35.0
5  Kalaiyarasan  23.0
6       Sukumar  45.0
7       Vignesh   NaN
8         Ramya  16.0
9         Muthu  40.0

In [68]:
type(df[['Name', 'Age']])

pandas.core.frame.DataFrame

## Filter DataFrame with specific set of columns - Example #2

In [69]:
df.drop(['Profession','Location', 'Gender'], axis=1)

           Name   Age
0          Arun  25.0
1         Vijay  20.0
2         Priya  18.0
3         Kumar  19.0
4         Selvi  35.0
5  Kalaiyarasan  23.0
6       Sukumar  45.0
7       Vignesh   NaN
8         Ramya  16.0
9         Muthu  40.0

## Creating a DataFrame with one Colume

In [70]:
df1 = pd.DataFrame({
    'Email': ['arun@mail.com', 'vijay@mail.com', 'priya@mail.com', 'kumar@mail.com', 'selvi@mail.com', 'kalaiyarasan@mail.com',
              'sukumar@mail.com', 'vignesh@mail.com', 'ramya@mail.com', 'muthu@mail.com']
})
df1

                   Email
0          arun@mail.com
1         vijay@mail.com
2         priya@mail.com
3         kumar@mail.com
4         selvi@mail.com
5  kalaiyarasan@mail.com
6       sukumar@mail.com
7       vignesh@mail.com
8         ramya@mail.com
9         muthu@mail.com

## Merge multiple DataFrames  (column-wise)

In [71]:
df_updated = pd.concat([df,df1], axis=1)
df_updated

           Name   Age   Gender Profession   Location                  Email
0          Arun  25.0     Male   Engineer    Chennai          arun@mail.com
1         Vijay  20.0     Male     Doctor  Bangalore         vijay@mail.com
2         Priya  18.0   Female    Teacher    Mumabai         priya@mail.com
3         Kumar  19.0  Male ee  Scientist      Delhi         kumar@mail.com
4         Selvi  35.0   Female   Business    Madurai         selvi@mail.com
5  Kalaiyarasan  23.0  Male ee   Engineer    Chennai  kalaiyarasan@mail.com
6       Sukumar  45.0     Male   Engineer  Bangalore       sukumar@mail.com
7       Vignesh   NaN     Male     Lawyer       Pune       vignesh@mail.com
8         Ramya  16.0   Female    Auditor    Chennai         ramya@mail.com
9         Muthu  40.0  Male ee   Engineer     Trichy         muthu@mail.com

## Rename column names

In [72]:
df_updated.rename(columns={'Location':'City'})

           Name   Age   Gender Profession       City                  Email
0          Arun  25.0     Male   Engineer    Chennai          arun@mail.com
1         Vijay  20.0     Male     Doctor  Bangalore         vijay@mail.com
2         Priya  18.0   Female    Teacher    Mumabai         priya@mail.com
3         Kumar  19.0  Male ee  Scientist      Delhi         kumar@mail.com
4         Selvi  35.0   Female   Business    Madurai         selvi@mail.com
5  Kalaiyarasan  23.0  Male ee   Engineer    Chennai  kalaiyarasan@mail.com
6       Sukumar  45.0     Male   Engineer  Bangalore       sukumar@mail.com
7       Vignesh   NaN     Male     Lawyer       Pune       vignesh@mail.com
8         Ramya  16.0   Female    Auditor    Chennai         ramya@mail.com
9         Muthu  40.0  Male ee   Engineer     Trichy         muthu@mail.com

## Get minimum value of a column

In [73]:
df_updated['Age'].min()

np.float64(16.0)

## Get maximum value of a column

In [74]:
df_updated['Age'].max()

np.float64(45.0)

## Get mean value of a column

In [75]:
average_age = df_updated['Age'].mean().astype(int)
average_age

np.int64(26)

## Replace NULL values with a specific value

In [76]:
df_updated['Age'] = df_updated['Age'].fillna(average_age)
df_updated

           Name   Age   Gender Profession   Location                  Email
0          Arun  25.0     Male   Engineer    Chennai          arun@mail.com
1         Vijay  20.0     Male     Doctor  Bangalore         vijay@mail.com
2         Priya  18.0   Female    Teacher    Mumabai         priya@mail.com
3         Kumar  19.0  Male ee  Scientist      Delhi         kumar@mail.com
4         Selvi  35.0   Female   Business    Madurai         selvi@mail.com
5  Kalaiyarasan  23.0  Male ee   Engineer    Chennai  kalaiyarasan@mail.com
6       Sukumar  45.0     Male   Engineer  Bangalore       sukumar@mail.com
7       Vignesh  26.0     Male     Lawyer       Pune       vignesh@mail.com
8         Ramya  16.0   Female    Auditor    Chennai         ramya@mail.com
9         Muthu  40.0  Male ee   Engineer     Trichy         muthu@mail.com

## Process column values

In [77]:
def fix_gender_value(val):
    val = val.split()[0]
    return val
df_updated['Gender'] = df_updated['Gender'].apply(fix_gender_value)
df_updated

           Name   Age  Gender Profession   Location                  Email
0          Arun  25.0    Male   Engineer    Chennai          arun@mail.com
1         Vijay  20.0    Male     Doctor  Bangalore         vijay@mail.com
2         Priya  18.0  Female    Teacher    Mumabai         priya@mail.com
3         Kumar  19.0    Male  Scientist      Delhi         kumar@mail.com
4         Selvi  35.0  Female   Business    Madurai         selvi@mail.com
5  Kalaiyarasan  23.0    Male   Engineer    Chennai  kalaiyarasan@mail.com
6       Sukumar  45.0    Male   Engineer  Bangalore       sukumar@mail.com
7       Vignesh  26.0    Male     Lawyer       Pune       vignesh@mail.com
8         Ramya  16.0  Female    Auditor    Chennai         ramya@mail.com
9         Muthu  40.0    Male   Engineer     Trichy         muthu@mail.com